#!/usr/bin/env python
# -*- coding: utf-8 -*-
# -------------------------------------------------------------------------------
# Name:        constants
# Purpose:     Contains local constants
#
# Author:      ANKorenuk
#
# Created:     2.06.2022
# Copyright:   (c) ANKorenuk 2022
# Licence:     <your licence>
# -------------------------------------------------------------------------------
# Содержит локальные переменные
# -------------------------------------------------------------------------------
# Расположение БД
PATH_DB_FOR_MAT = f"{__file__}".replace("obj\\constants.py", "data\\materials.db")
# Настройки для начальных данных
DEFAULT_SETTINGS_FOR_MATERIALS = {
    "brand": "20",
    "type_of_heat_treatment": None,
    "HRC": None,
    "workpiece": 2,
    }
# Список материалов по умолчанию (key - индекс класса материала)
DEFAULT_NAMES_FOR_MATERIALS = {0: "20ГЛ",
                               1: "Р6М5",
                               2: "20Г",
                               3: "1088",
                               4: "15Х5М",
                               5: "20Х17Н2",
                               6: "СЧ10",
                               7: "КЧ30-6",
                               8: "БрО10",
                               9: "Л60",
                               10: "М1",
                               11: "А7"}
# Описание типа термообработки
NAMES_OF_HEAT_TREATMENT = {None: "Без термообработки", 0: "Нормализация", 1: "Отжиг", 2: "Улучшение"}
INDEXES_OF_HEAT_TREATMENT = {"Без термообработки": None, "Нормализация": 0, "Отжиг": 1, "Улучшение": 2}

# Описание типа поверхности заготовки
NAMES_OF_WORKPIECE = {0: "Без корки", 1: "С коркой: прокат", 2: "С коркой: поковка", 3: "Отливка с нормальной коркой",
                      4: "Отливка с загрязненной коркой", 5: "С коркой: Медные и алюминиевые сплавы"}
INDEXES_OF_WORKPIECE = {"Без корки": 0, "С коркой: прокат": 1, "С коркой: поковка": 2, "Отливка с нормальной коркой": 3,
                        "Отливка с загрязненной коркой": 4, "С коркой: Медные и алюминиевые сплавы": 5}
