#!/usr/bin/env python
# -*- coding: utf-8 -*-
# =====================================================================================================================
# Настройки БД
DEFAULT_SETTINGS = {
    'path': f"{__file__}".replace("obj\\constants.py", "data\\materials.db"),
    'db_type': "sqlite",
    'reader_type': 'pandas_table'
}
# =====================================================================================================================
# Настройки для начальных данных
DEFAULT_SETTINGS_FOR_MATERIAL = {
    "brand": "20",
    "type_of_heat_treatment": None,
    "hrc": None,
    "workpiece": 0,
}
DEFAULT_BRAND = DEFAULT_SETTINGS_FOR_MATERIAL["brand"]
# =====================================================================================================================
# Список материалов по умолчанию (key - индекс класса материала)
DEFAULT_NAMES_FOR_MATERIALS = {0: "20ГЛ", 1: "Р9",   2: "20",     3: "10880",  4: "15Х5М",  5: "20Х17Н2",
                               6: "СЧ10", 7: "КЧ30-6", 8: "БрО10Ф1", 9:   "Л60", 10: "М1",    11: "А7"}
# =====================================================================================================================
# Описание доступных классов материалов
CLASSES_MATERIALS = {0: 'Сталь для отливок',         1: 'Сталь инструментальная',
                     2: 'Сталь конструкционная',     3: 'Сталь электротехническая',
                     4: 'Сталь, сплав жаропрочные',  5: 'Сталь, сплав коррозионно-стойкие',
                     6: 'Чугун серый',               7: 'Чугун ковкий',
                     8: 'Бронза',                    9: 'Латунь (медно-цинковый сплав)',
                     10: 'Медь, сплав меди',        11: 'Алюминий, сплав алюминия',
                     }
# =====================================================================================================================
# Описание типа термообработки
HEAT_TREATMENT = {None: "Без термообработки", 0: "Нормализация", 1: "Отжиг", 2: "Улучшение"}
# =====================================================================================================================
# Описание типов поверхности заготовки
WORKPIECE = {0: "Без корки", 1: "С коркой: прокат", 2: "С коркой: поковка", 3: "Отливка с нормальной коркой",
             4: "Отливка с загрязненной коркой",    5: "С коркой: Медные и алюминиевые сплавы"}
# =====================================================================================================================
# Описание переменных классов
DECODING = {"brand": "Наименование материала: {obj}.",
            "type_of_mat": "Тип материала: {obj}.""",
            "class_": "Класс материала: {obj}.",
            "subclass": "Подкласс материала: {obj}.",
            "hardness_mpa_for_proc": "Твердость обрабатываемого материала = {obj} МПа.",
            "tensile_strength_mpa_for_proc": "Предел текучести для обрабатываемого материала = {obj} МПа.",
            "type_of_heat_treatment": "Вид термообработки обрабатываемого материала = {obj}.",
            "hrc": "Твердость обрабатываемого материала после термообработки = {obj} HRC.",
            "workpiece": "Состояние заготовки: {obj}.",
            "hardness_tabl_mpa": "Таблица твердости материала (в МПа): {obj}",
            "tabl_tensile_strength_mpa": "Таблица пределов прочности (в МПа): {obj}",
            "chemical_composition": "Химический состав материала: {obj}"
            }
